[{"address":"600 11th Ave.","website":"gothamwestmarket.com ","neighborhood":"Hell's Kitchen","image":"http://images.complex.com/complex/image/upload/t_article_image/ayvf1nn5jfgivicqx9if.jpg","description":"There are days you want to eat something, and others where you want to eat <em>everything</em>. On the latter, you&apos;d be well-advised to head to Gotham West Market. The multi-vendor gastro wonderland is an indecisive eater&apos;s dream. Unlike similar concepts like Chelsea Market, Gotham West has only eight carefully-chosen vendors, each of which occupies a small slice of the sleek space. Sit at Cannibal&apos;s counter and take down a pig&apos;s head cuban sandwich at Cannibal, or&#xA0;<a target=\"_blank\" href=\"http://www.complex.com/city-guide/2014/03/the-best-ramen-in-nyc/ivan-ramen-slurp-shop\">slurp a bowl of Ivan&apos;s savory rye noodles.&#xA0;</a>&#xA0;Stop by&#xA0;Genuine Roadside for a burger and a side of &apos;70s nostalgia, or wash down tapas with Rioja at chef Seamus Mullen&apos;s tapas bar. Sure, it&apos;s avenues away from a subway, but with a Blue Bottle and a bike store on premise, Gotham West&apos;s many diversions can easily consume an entire afternoon. Or, have you consuming for an entire afternoon. Both are strong options. &#x2014; <a target=\"_blank\" href=\"https://twitter.com/ShanteCosme\">Shant&#xE9; Cosme</a><br>\r\n&#xA0;","favorite":false},{"address":"140 W. 4th St.","website":"redbamboo-nyc.com","neighborhood":"Greenwich Village","image":"http://images.complex.com/complex/image/upload/t_article_image/afv0e3rqgtye3rplmqsh.jpg","description":"If you&#x2019;re looking for a restaurant that offers a menu contrary to your normal steak and potatoes type of dinner, Red Bamboo is definitely the place to experience.&#xA0; Yeah, it&#x2019;s a vegan friendly restaurant, but the delectable panko breaded and rosemary seasoned Soul &#x201C;Chicken&#x201D; will easily influence anyone to come back for more. The menu is unique, ranging from vegan burgers to soy beef, and the close-knit &quot;homey&quot; feel will seem as if you&#x2019;re at your mother&#x2019;s house for dinner. Stop by for lunch or grab a bite with&#xA0;your date before happy hour.<span>&#x2014;</span><a href=\"https://twitter.com/cedrich__\" target=\"_blank\">Cedric Hall</a>&#xA0;<span></span>&#xA0;","favorite":false},{"address":"76 Mott St.","website":"bassanovanyc.com ","neighborhood":"Chinatown ","image":"http://images.complex.com/complex/image/upload/t_article_image/lcecede0v5yldxuw6hed.jpg","description":"Outside of Japan, New York is just about the best city for ramen in the world. You have Ippudo, Momofuku, Ivan, Chuko, Totto, and that&apos;s just off the top of my head. Still, Bassanova Ramen stands out when it comes to wild flavors and radical experimentation. Founded by&#xA0;Japanese-American Chef Keizo Shimamoto who learned his craft at the original Bassanova&#xA0;in Japan, the recipes include ingredients like Thai curry and truffle oil added to the rich <em>dashi</em>. The Tondaku Green Curry Ramen, in particular, is one of the best bowls&#xA0;I&apos;ve had in recent memory. Slurrrrp. &#x2014; <a href=\"http://twitter.com/nathanreese\">Nathan Reese&#xA0;</a><br><br>","favorite":false},{"address":"Various","website":"xianfoods.com ","neighborhood":"Various","image":"http://images.complex.com/complex/image/upload/t_article_image/oj284yvjtzrmg1vbwfdn.jpg","description":"Xi&apos;an Famous Foods started as a tiny basement location in Flushing&apos;s Golden Mall, but has since grown into a small empire that spans from Greenpoint to the Upper West Side. Specializing in the pallet-searingly spicy cuisine of&#xA0;Xi&apos;an in Western China, the food isn&apos;t for those who gravitate toward bland and boring. But for urban explorers&#xA0;looking for something with more punch than General Tso&apos;s, there&apos;s no better place to find it. Standout dishes include the&#xA0;Spicy and Tingly Beef Hand-Ripped Noodles and the Lamb Face Salad. Yep, you read the right: lamb face&#x2014;and it&apos;s delicious. &#x2014; Nathan Reese","favorite":false},{"address":"127 Orchard St.","website":"russanddaughters.com","neighborhood":"Lower East Side ","image":"http://images.complex.com/complex/image/upload/t_article_image/ntle4ygid27mg1gf1ecw.jpg","description":"In the new sit-down restaurant on Orchard Street, they&apos;ve managed to adapt an already perfect thing into simply more perfection, from the big band piping over the speakers to the soda shop-style counters, heavy dishware, and especially that menu: Latkes. Bagles. Bialys. Smoked salmon, lox, and herring. Caviar. Egg creams. Shrubs. Sure, there are some creative flourishes on the menu, but at the end of the day, these are mostly ages-old dishes in a restaurant that&apos;s had a century of incredibly high standards to live up to before it even opened. And yet: Russ &amp; Daughters cafe doesn&apos;t just live up to those impossibly high expectations, but succeeds them. It usually takes a long time for something to become a classic. With Russ &amp; Daughters cafe, it just took that first nosh. &#x2014;Foster Kamer","favorite":false},{"address":"146 Broadway","website":"babysallright.com","neighborhood":"South Williamsburg","image":"http://images.complex.com/complex/image/upload/t_article_image/ghyvhi2w1gw5w1ftfjjd.jpg","description":"<a href=\"http://babysallright.com/\" target=\"_blank\"></a>Right around the time 285 Kent closed its doors, it seemed like every party shifted over to Baby&#x2019;s All Right. But the two venues couldn&#x2019;t be any more different. Baby&#x2019;s, by weekend day, is a brunch spot with a usually fantastic drunk brunch special. Tucked right under the Williamsburg bridge, the spot hosts some of the very best DJ nights (THE KID MERO and Dapwell, included) and the back room serves as the perfect venue for a plethora of artists, not to mention there&#x2019;s a fucking replica of the maze from The Shining on the floor of the performance area. Everyone from DIIV to Charli XCX to Ratking and more have performed in the back venue space, and with the &#x201C;Pink Baby&#x201D; drink, the spot is sure to only get more popular in the next year.&#x2014; <a href=\"https://twitter.com/LAURENcynthia\" target=\"_blank\">Lauren Nostro</a>","favorite":false},{"address":"15 Mercer St.","website":"3x1.us","neighborhood":"SoHo","image":"http://images.complex.com/complex/image/upload/t_article_image/wl52ax9fphrva7pf7zix.jpg","description":"There&apos;s no shortage of places to buy a decent, stylish pair of jeans in New York City. But for those religious about their denim&#x2014;or who are just looking for that elusive, perfect pair&#x2014;there&apos;s only one place you really need to go: 3x1, the brainchild of former Evisu designer and Paper, Denim, Cloth founder Scott Morrison. And while 3x1&apos;s Mercer Street storefront might not look like the most important place to buy jeans in the universe, it won&apos;t take more than a few seconds inside for you to figure the whole thing out. On the right are different cuts of denim, hung in plexiglass boxes on the wall, the fine art treatment for a pair of pants. Towards the back you&apos;ll probably catch a seamstress or two in the workshop, which is right there, in-house, working on jeans you could soon walk out wearing. In the center of the room, you&apos;ll find denim customizations of every possible variant, waiting for you to pick from them: Rivets, buttons, pocket shapes, linings, pipings, selvedge strips, interior pocket patterns. If there&apos;s a way to customize a pair of jeans, they have it, and they will do it. But nothing will prepare you for what&apos;s on the left side of the room: The Denim Wall. No, really: It&apos;s a wall that feels like a mountain, stacked topped to bottom with various giant spools of denim, and denim that&apos;s been personally collected from all over the world and brought here, for you. Black denim, grey denim, blue denim that fades to purple, purple denim that fades blue, denim as heavy as shag carpet or as light as tracing paper, denim that tastes like schnozzberries, etc. And yeah, we might&apos;ve made one of those up, but then again, having seen with our own eyes the variants of denim Morrison has collected, and what one can do with them: For the right price? We wouldn&apos;t put it past them, either. &#x2014;Foster Kamer","favorite":false},{"address":"170 Elizabeth St.","website":"blackseedbagels.com ","neighborhood":"Nolita","image":"http://images.complex.com/complex/image/upload/t_article_image/jdwbfzkhmjxz7bjs1sue.jpg","description":"<span>If you&apos;re a New Yorker, Montr&#xE9;alais, or person who just likes good food (and doesn&apos;t have a gluten intolerance), chances are you have strong opinions about where to find the world&apos;s best bagels. Still, there are some constants that most everyone can agree on: a bagel should be hand rolled, boiled, dense (but not too dense), chewy (but not too chewy), and well seasoned. Black Seed, SoHo&apos;s new haute bagelry, plays like the perfect amalgam of those variables. Bagels are small&#x2014;(no &quot;scooping&quot; here) but beautiful pieces of art. Toppings are also ingeniously devised, with the house-made beet-cured lox standing out as a highlight. Like most of the flavors at Black Seed, there&apos;s nothing overpowering about the fish, there&apos;s just an additional depth of flavor.) Also delicious is the tobiko caviar, which I would eat dangerous amounts of if given free reign in the kitchen. Something to note, however, is that the bagels really are small. If you want to get your fill, you&apos;ll have to order one of the excellent side-salads. Don&apos;t be daunted by the long line: The wait is worth it. &#x2014; <a href=\"https://twitter.com/nathanreese\" target=\"_blank\">Nathan Reese</a></span><br><br>","favorite":false},{"address":"67 S. 6th St","website":"bia67.com","neighborhood":"South Williamsburg","image":"http://images.complex.com/complex/image/upload/t_article_image/tl2vu10oyyllahyqwup9.jpg","description":"<a href=\"http://bia67.com/\" target=\"_blank\"></a>Enjoy a soothing summer evening on a cozy rooftop with a bowl of the best Pho broth you can cop in Williamsburg. This Vietnamese establishment lures its guests in simply with the design&#x2014;dark wooden tabletops, exposed ceilings, dangling light fixtures, and a sleek bronze color that brings it all to life. Your shrimp dumplings or stir-fried tofu will come out faster than you expect, alongside the specially-made intoxicating drinks. Drop in and have a bite to eat with some friends if Vietnamese food tickles your fancy.&#x2014;<a href=\"https://twitter.com/cedrich__\" target=\"_blank\">Cedric Hall</a>","favorite":false},{"address":"1170 Broadway","website":"thenomadhotel.com ","neighborhood":"Flatiron ","image":"http://images.complex.com/complex/image/upload/t_article_image/dp7npjhfajktfwfibexg.jpg","description":"<span>We say hit the atrium during the day, one of the greatest naturally-lit spaces in New York to grab a cup of coffee or breakfast right now. But more than anywhere else there these days, it&apos;s the recently opened two-story bar room at The NoMad&#x2014;replete with its own distinct cocktail and food menu from the restaurant, one that&apos;s already earning raves from New York City&apos;s most Twittered expense account holders&#x2014;that&apos;s the place to be. Expensive as hell? Yes. But if you&apos;ve got it, and got it to spend? Spend it here. - Foster Kamer</span>","favorite":false},{"address":"207 Second Ave.","website":"momofuku.com","neighborhood":"East Village","image":"http://images.complex.com/complex/image/upload/t_article_image/cbelnpw8witlrakhxngq.jpg","description":"<span>Is it one of those too-tired Manhattan cocktail bars you&apos;ve heard far too much about, that makes too far a fuss over their mixology standards? Sure, yeah, it&apos;s one of those. But it&apos;s also the kind of place that can make you leave your cynicism about institutions like these behind, as it&apos;s operated by David Chang and Co, the reigning kings of taking ostensibly stupid ideas and turning them into brilliant Manhattan institutions that have yet to lose their luster. Yes, master bartender Dave Arnold is clarifying liquids and using liquid nitrogen and doing all kinds of wacky shit with his booze. But at the end of the day, it&apos;s a great space to grab a solid-if not downright incredible-drink, and the snacks are halfway decent, too. Avoid at your own peril. -</span><a target=\"_blank\" style=\"font-family: &apos;Droid Serif&apos;, sans-serif; font-size: 15px; font-style: normal; font-variant: normal; line-height: 26px; text-decoration: none; color: rgb(204, 153, 0); background-color: rgb(250, 250, 250);\" href=\"https://twitter.com/weareyourfek\">Foster Kamer</a>","favorite":false},{"address":"67 E. 11th St.","website":"bergino.com","neighborhood":"Greenwich Village","image":"http://images.complex.com/complex/image/upload/t_article_image/gc7tsfxs2gmo9vamhvwy.jpg","description":"Bergino Baseball Clubhouse offers a unique twist to baseball accessories, producing extraordinary items perfect for the game&#x2019;s fanatics and gifting. If you&#x2019;ve ever marked a map-designed or fuzzy purple suede ball down on your wish list, this shop that generates hand-made items will have that arranged. The venue itself&#x2014;well known for its dope artwork and decorative fixtures like the Babe Ruth photo made of Legos and even a color-coded wall with baseballs neatly resting in steel baskets. No matter the desire to throw events at the place or just browsing, this is definitely a landmark to bring those who are seriously devoted to having some exclusive baseball collectables hanging around the house.&#x2014;<a href=\"https://twitter.com/cedrich__\" target=\"_blank\">Cedric Hall&#xA0;</a>","favorite":false},{"address":"38 W. 86th St.","website":"bgc.bard.edu","neighborhood":"Upper West Side","image":"http://images.complex.com/complex/image/upload/t_article_image/ofr1mtcskphids2uoven.jpg","description":"<a href=\"http://bgc.bard.edu/\" target=\"_blank\"></a><span>Do you love museums and hate crowds? Visit this charming UWS townhouse for a double dose of intellectual stimulation and solitude. Connected to the Bard Graduate Center, which focuses on new ways of thinking about decorative arts and design, the museum hosts a handful of rotating exhibitions a year. This summer&#x2019;s show (closing August 10), Waterweavers: The River in Contemporary Colombian Visual Art, is all about textiles and drugs. Within, there&#x2019;s a floating woven boat (awesome), and some extraordinary multichannel videos that contrast the seductive calm of rainforest with the jarring rat-tat-tat of drug cartel gun fire. It&#x2019;s cerebral stuff, but delivered through an experience you won&#x2019;t replicate at one of New York&#x2019;s monolithic institutions. Plus, at $7, the BGC won&#x2019;t damage your beer fund like a visit to MOMA might. &#x2014; <a href=\"https://twitter.com/nschon\" target=\"_blank\">Nick Schonberger</a>&#xA0;</span>","favorite":false},{"address":"Washington Square Park","website":"nycgovparks.org","neighborhood":"Greenwich Village","image":"http://images.complex.com/complex/image/upload/t_article_image/nnwgp4f2xjv6cqsbfil9.jpg","description":"It&apos;s definitely not our city&apos;s most famed park, nor is it the greenest, but therein lies its most special charm: A pronounced lack of tourists, in one of the most touristy and ritzy neighborhoods in the city. It may be, as far as big parks go, the one most hidden in plain sight. And despite NYU buildings crowding up around it like an invasive species, the place still always feels diverse, alive, and quintessentially New York, in that it&apos;s a perfectly free, useful way to regularly remind ourselves of why we put up with all the shit we do to live here. &#x2014;&#xA0;<a href=\"https://twitter.com/weareyourfek\" target=\"_blank\">Foster Kamer</a>","favorite":false},{"address":"348 Dyckman St.","website":"lamarinanyc.com","neighborhood":"Washington Heights","image":"http://images.complex.com/complex/image/upload/t_article_image/lk2lv84or4rvp0odjs5f.jpg","description":"La Marina provides its guests with one of the best views in the city. You&#x2019;ll be able to enjoy some of their delectable happy hour cocktails, all while eating an awesome meal overlooking the Hudson River. The resort-style feel makes the location one of the few blissful hideaways in Midtown. Pat down your sides before entering to make sure your pockets are swollen though, it can get a tad pricey. Nonetheless, great experience overall for your next event, date, or personal celebration.&#x2014;<a href=\"https://twitter.com/cedrich__\" target=\"_blank\">Cedric Hall</a>&#xA0;","favorite":false},{"address":"15 E. 4th St.","website":"othermusic.com","neighborhood":"NoHo ","image":"http://images.complex.com/complex/image/upload/t_article_image/yuv7eqj5zoa3kpg5kz4z.jpg","description":"For those who go beyond the effortless process of synching albums to your phone in order to vibe to music everyday, the record store Other Music in Noho has a plethora of vinyl and CDs to snag for the crib. The vibe in the shop is very personal, yet hippie-esq, as guests are able to play an entire record if they choose while shopping through racks on racks of underground artists and experimental musicians. Hands down, the employees are very knowledgeable and are always willing to help customers dig into some great finds. There&#x2019;s even a &#x201C;cheapies&#x201D; section that offers discs as low as a buck. This place is definitely a hidden treasure within the city.&#x2014;<a href=\"https://twitter.com/cedrich__\" target=\"_blank\">Cedric Hall</a>","favorite":false},{"address":"103 2nd Ave.","website":"mightyquinnsbbq.com","neighborhood":"East Village","image":"http://images.complex.com/complex/image/upload/t_article_image/y78zxjhxxprfampyk7sx.jpg","description":"We all know that finding quality barbecue in NYC is like searching for a small ass needle in a haystack. Mighty Quinn&#x2019;s has proven to city-goers that they are the spot with the golden ticket. Be prepared to take an adventure with some of the most savory meats and flavorful sides in a setting that bleeds a soulful, southern feel unlike anywhere else in the city. &#xA0;To make the experience even better, it is the first authentic barbecue spot in a fast-casual environment. That being said, you can grab a filling plate of their tender, smoked brisket and frites quickly on your lunch break if you&#x2019;re having an uncontrollable craving for <em>Texalina Barbe</em><em>qu</em><em>e</em>.&#x2014;<a href=\"https://twitter.com/cedrich__\" target=\"_blank\">Cedric Hall</a>","favorite":false},{"address":"828 Broadway","website":"strandbooks.com","neighborhood":"East Village ","image":"http://images.complex.com/complex/image/upload/t_article_image/xkanetsqpf2szhz7ytxd.jpg","description":"<a href=\"http://www.strandbooks.com/\" target=\"_blank\"></a>It&#x2019;s safe to say that The Strand is a one-of-a-kind bookstore. Established in 1927 by Benjamin Bass on Fourth Avenue as part of &#x201C;bookstore row,&#x201D; it moved to its current location in the &#x2018;50s as the sole survivor. With its three stories containing &#x201C;18 miles&#x201D; of books&#x2014;possibly not including the dollar racks outside&#x2014;The Strand is a very lively relic from the increasingly distant past, containing both claustrophobia-inducing racks reaching to the ceiling on the main floor and airy reading spaces in the art and photo sections on the second. The rare book room plays host to talks from prominent authors and artists, ranging from Raymond Pettibon to David Sedaris, as well as housing inscribed works as well as first editions. As book shopping becomes an evermore sterile experience, The Strand stands as a reminder that it doesn&#x2019;t have to be that way.&#x2014;&#xA0;<a href=\"https://twitter.com/russbengtson\" target=\"_blank\">Russ Bengtson&#xA0;</a>","favorite":false},{"address":"514 Union St.","website":"royalpalmsshuffle.com","neighborhood":"Gowanus","image":"http://images.complex.com/complex/image/upload/t_article_image/irywfpfz5clg09igysqn.jpg","description":"The Royal Palms Shuffleboard Club is an extremely low key place that invites its guests to step out of their normal happy hour routine and try something new for a change. If you have no clue of what shuffleboard is, here&apos;s the gist: you push a weighted puck down a court with broom-shaped paddles&#x2014;not too hard&#x2014;hoping it lands on the most points possible. The &#xA0;thing that makes the Royal Palms stand out is the availability to make shuffleboard a drinking game. The place offers cocktail specials, delicious food trucks for some grub, and a massive space so that no one gets&#xA0;in your way. &#xA0;Be spontaneous for a change and head out to the shuffleboard lanes.&#xA0;<span>&#x2014;&#xA0;</span><a href=\"https://twitter.com/cedrich__\" target=\"_blank\">Cedric Hall</a><span></span>&#xA0;","favorite":false},{"address":"95 Commercial St.","website":"glasserienyc.com ","neighborhood":"Greenpoint","image":"http://images.complex.com/complex/image/upload/t_article_image/qjwl6q4xsy1jcbvza7tn.jpg","description":"As&#xA0;Greenpoint has shifted from industrial zone and&#xA0;Polish enclave to hipster mecca, its food game has evolved accordingly. Case in point: Glasserie, a new Mediterranean restaurant at the far northern tip of the neighborhood. Founded by&#xA0;Sara Conklin and located in an old glass factory&#x2014;hence its name&#x2014;the restaurant specializes in delicious takes on tried-and-true classics. Menu items include lots of seafood and lamb dishes, but the standout is the rabbit, which is up there with some of the best food you can find anywhere in New York City right now. &#x2014; Nathan Reese","favorite":false},{"address":"812 Broadway ","website":"flightclub.com","neighborhood":"Greenwich Village","image":"http://images.complex.com/complex/image/upload/t_article_image/wwvzwr9v8k6g5jxd7tq2.jpg","description":"If you&#x2019;re a sneakerhead (or not) chances are you&#x2019;ve heard the raving reviews Flight Club receives on the daily. &#xA0;For a decade, Flight Club has been the middle passage for buying, selling, and trading limited edition and vintage sneakers. People from all over the world have trekked to the two exclusive US stores to step foot in the heavenly kingdom of sneakers that are difficult to stumble upon anywhere else. The sign-less storefront could initially fool first-time guests into thinking less of the place. However, once inside, it&#x2019;s as if you reached the end of the rainbow and are now aimlessly forced to sift through kicks and apparel for purchase. Shopaholics may want to stay at home for this one, because you&#x2019;re sure to walk out with more than you bargained for. &#x2014;<a href=\"https://twitter.com/cedrich__\" target=\"_blank\">Cedric Hall</a>&#xA0;<em></em>","favorite":false},{"address":"5th Ave. at 42nd St.","website":"nypl.org","neighborhood":"Midtown","image":"http://images.complex.com/complex/image/upload/t_article_image/a2l4ac5lnhlizxblgzlp.jpg","description":"Serving the New York area for over a century, the New York Public Library has been an essential provider to many neighborhoods and visitors for quite a while. It&#x2019;s a place that holds history, heritage, and an exceptional abundance of resources available to anyone who may come into contact with the place&#x2014;which makes it a pretty dope library to stumble across. Channel into your creative psyche and sign up for the offered poetry workshops, or check out exhibitions from notable photographers like <a href=\"http://www.nypl.org/events/exhibitions/donald-andrew-agarrat-harlem-photographer\" target=\"_blank\">Donald Andrew</a>. This experience is sure to leave you up on game to more information you may have been blinded by before entering.&#x2014;<a href=\"https://twitter.com/cedrich__\" target=\"_blank\">Cedric Hall</a>&#xA0;","favorite":false},{"address":"147 Green Ave.","website":"primrosenyc.com ","neighborhood":"Clinton Hill","image":"http://images.complex.com/complex/image/upload/t_article_image/uuvij5at6drmlw2wrrx5.jpg","description":"<span>If Fort Greene is the new Park Slope, then Clinton Hill is the old Fort Greene. That doesn&#x2019;t make much sense, but, hey, they have to justify raising the rent somehow. In any case, Primrose is one of the places that make Clinton Hill so friendly and welcoming. It&#x2019;s a tiny caf&#xE9; on the garden floor of a brownstone. It&#x2019;s got vegan and gluten-free snacks, great music on the stereo, a New York Times on the table for you to read, a sunny backyard, and friendly staff. It&#x2019;s easy to miss because it looks like it should be someone&#x2019;s apartment, but those in the know come to Primrose early and often on the weekends.&#xA0;<span>&#x2014;&#xA0;</span><a href=\"https://twitter.com/laurettaland\" target=\"_blank\">Lauretta Charlton</a></span><br><br>","favorite":false},{"address":"Various","website":"varietynyc.com","neighborhood":"Williamsburg","image":"http://images.complex.com/complex/image/upload/t_article_image/ja2bsgxipyv43xqcdwxy.jpg","description":"But the newest spot isn&apos;t just going to be a new center of gravity for far Bushwick, it&apos;s also where Variety&apos;s going to be roasting its own coffee, too. That said, it won&apos;t change the appeal Variety&apos;s always had, inspiring diehard loyalty in regulars and making them critical drop-ins whenever you&apos;re in their &apos;hoods: The people. Variety&apos;s baristas aren&apos;t just some of the greatest in the city, but the friendliest, too, and they&apos;ll serve the Pitchfork-approved songwriter, the Sundance darling screenwriter, the neighborhood old-timers, and you with no more and no less the same niceties. Some days in north Brooklyn, there&apos;s just no better way to kill time inside&#x2014;and maybe meet some great people&#x2014;than a hour spent throwing back coffee in a Variety. &#x2014;&#xA0;Foster Kamer","favorite":false},{"address":"674 Manhattan Ave","website":"belovedbar.com","neighborhood":"Greenpoint","image":"http://images.complex.com/complex/image/upload/t_article_image/qjsuohysqhnzbk6zf6qq.jpg","description":"Beloved happens to be one of those neighborhood bars that you and your friends can randomly walk into if you plan to grab amazing drinks in more of a chill atmosphere. There&#x2019;s an open space for dancing, a backyard, and of course a bar where bartenders are enthused to serve specialty drinks. There&#x2019;s no doubt the people in here know exactly what they&#x2019;re doing. Sit back, relax, and allow the bartender to concoct a drink that matches your mood, I guarantee you&#x2019;ll fall in love with the place. Consider Beloved for your next celebration or casual date.<span>&#x2014;</span><a href=\"https://twitter.com/cedrich__\" target=\"_blank\">Cedric Hall</a>&#xA0;","favorite":false},{"address":"274 Lafayette St.","website":"supremenewyork.com","neighborhood":"SoHo, Nolita","image":"http://images.complex.com/complex/image/upload/t_article_image/dzmefqifpgafbrz2casy.jpg","description":"This skateboarder&#x2019;s safe haven is located in a cozy little shop in&#xA0;Soho. The gear&#x2014;high-end apparel, such as the Nike SB sneaker line exclusively available in skateboard shops, is sure to send skate rats into a frenzy. Even if you aren&#x2019;t into skating and enjoy the brand itself, dropping by the store is an experience alone. After working with pioneering designers, musicians, and artists, Supreme has become a cultural landmark that anyone should check out if they are in the NYC area.&#x2014;<a href=\"https://twitter.com/cedrich__\" target=\"_blank\">Cedric Hall</a>","favorite":false},{"address":"109 3rd Ave.","website":"kiehls.com ","neighborhood":"Various","image":"http://images.complex.com/complex/image/upload/t_article_image/edonp7ckpwlyknxyius0.jpg","description":"It may seem strange to put a luxury cosmetics shop on a list filled with bars, music venues, and restaurants, but Kiehl&apos;s, whether you know it or not, is as much of a New York institution as Russ &amp; Daughters or the New York Public Library. Kiehl&apos;s was founded way back in 1851 and has occupied the same storefront in the East Village since then, meaning it has spent one hundred and fifty years in the same exact spot. Though the original pharmacy may look a different than it did in pre-Civil&#xA0;War days, it still has an appealingly&#xA0;old time-y vibe. It&apos;s worth stopping by if you need some quality shampoo, or just for the comfort that, though businesses and bars come and go,&#xA0;some things&#xA0;never change. &#x2014; Nathan Reese","favorite":false},{"address":"178 7th Ave. S","website":"villagevanguard.com ","neighborhood":"West Village","image":"http://images.complex.com/complex/image/upload/t_article_image/r1mghrgpyieic5kkqcam.jpg","description":"The Village Vanguard is more than a jazz club. It&#x2019;s an institution. In 2015, it will have been around for 80 years. The number of musicians who have graced its stage is staggering. You walk down 15 steps and find yourself in a small room with cramped tables and a host, Lorraine Gordon, who does not give a shit who you are or what you&#x2019;re doing in the club that her husband opened in 1935. She&#x2019;s there to uphold some unspoken rule about making sure jazz musicians know that they still have a place to call home in New York City. Recording a live album at the Village Vanguard is a badge of honor that any self respecting Miles Davis-lover would appreciate. The only thing better than listening to a live version of Sonny Rollins recorded at the Vanguard, is to see him there on the stage. You don&#x2019;t even have to be a jazz fan to love this place. You just need to appreciate its deep history in the New York arts scene. Once you&#x2019;re there, you&#x2019;ll realize that the history and legend is seeping through the walls. That sensation alone will get you through the first set of the night. &#x2014; <a href=\"https://twitter.com/laurettaland\" target=\"_blank\">Lauretta Charlton</a>&#xA0;<br><br>","favorite":false},{"address":"181 Thompson St.","website":"carbonenewyork.com","neighborhood":"Greenwich Village","image":"http://images.complex.com/complex/image/upload/t_article_image/ajvnmh7epbxae36xcfup.jpg","description":"<a href=\"http://carbonenewyork.com/\" target=\"_blank\"></a><span>Carbone is the Italian restaurant you want to be at in 2014. The old world Italian cuisine that boasts big portions of the basics done the best&#x2014;the veal parm, meatballs (best in the city, sorry everyone else) and the spicy rigatoni ala vodka are absolute musts. Besides the stellar food, Carbone&#x2019;s decor successfully takes you back to the 50&#x2019;s&#x2014;checkered tile floor from &#x201C;The Godfather&#x201D; and all. There may be a homage to the classic film, but Carbone succeeds where other Italian restaurants in that the Italian atmosphere isn&#x2019;t cliche nor corny. The wait staff is friendly, hip and doesn&#x2019;t try too hard to impress you with their faux Italian accent. During the early evening dinner hours classic music from the 50s and 60s permeates the dining room and later in the night at around 11:30 a perfect all Hip-Hop (Jay Z, Biggie, Tupac, etc etc) playlist kicks in. It&#x2019;s not often you get to leave a place and brag to your friends &#x201C;I went to the best Italian spot in the city,&#x201D; but you can when you leave Carbone. &#x2014; <a href=\"https://twitter.com/JLaPuma\" target=\"_blank\">Joe La Puma</a></span>","favorite":false},{"address":"1047 Manhattan Ave.","website":"eastrivertattoo.com","neighborhood":"Greenpoint","image":"http://images.complex.com/complex/image/upload/t_article_image/fypkrphpse0klvtdubge.jpg","description":"<a href=\"http://eastrivertattoo.com/\" target=\"_blank\"></a><span>In a city full of great tattoo shops, none is cooler than East River. Owned by contemporary artist Duke Riley and designed by tattooer Sue Jeiven, the shop has a quirky old-school maritime vibe fitting of the type of tattoos they needle into skin. Walk-ins are welcome, and even if you aren&apos;t looking for any body modification, its worth a visit for inspiration alone. - <a href=\"https://twitter.com/nschon\" target=\"_blank\">Nick Schonberger</a></span>","favorite":false},{"address":"158 Rivington St.","website":"alifenewyork.com","neighborhood":"Lower East Side","image":"http://images.complex.com/complex/image/upload/t_article_image/sbcxpgv66lkh9eyrjyn7.jpg","description":"Been looking for those retro Nike&#x2019;s for quite sometime now? If you come across the Alife Rivington Club, the shoe gods might grant your wishes and make your dreams come true. This place is known for having all of the &#x201C;hard to find&#x201D; kicks in stock at their Rivington Street location. The store is extremely personal creating an exclusive shopping adventure with their dark wooden shelves and alluring mood lighting. &#xA0;Apparently, this one&#x2019;s not for the footlocker freaks either, true sneakerheads need to brace themselves for the experience they&#x2019;ve been striving for, for so long. This place has a profound reputation, so drop in if you have a stack to throw.<span>&#x2014;</span><a href=\"https://twitter.com/cedrich__\" target=\"_blank\">Cedric Hall</a>&#xA0;","favorite":false},{"address":"Various","website":"warbyparker.com","neighborhood":"SoHo, South Village ","image":"http://images.complex.com/complex/image/upload/t_article_image/x7w8ks1q6gnqc879jwb5.jpg","description":"<a href=\"http://warbyparker.com/\" target=\"_blank\"></a><span><span>Warby</span>&#xA0;Parker is everyone&apos;s favorite mail-order glasses service, serving-up designer frames at affordable prices. But you already know this. What you may not know&#xA0;is that WP also happens to have four fabulous showrooms in New York&#xA0;where you can see their whole stock in person. These brick and mortar shops are staffed with helpful folks&#xA0;that will walk you</span>&#xA0;through the order process and find a frame that&apos;s just right for your face. E-commerce may be the future,&#xA0;but nothing beats actually holding something in your hand before you buy it.&#xA0;&#x2014;&#xA0;<a href=\"https://twitter.com/NathanReese\" target=\"_blank\">Nathan Reese</a>","favorite":false},{"address":"1271 Myrtle Ave.","website":"bossanovacivicclub.com ","neighborhood":"Bushwick","image":"http://images.complex.com/complex/image/upload/t_article_image/cg8iolvwqmrjqadigjc9.jpg","description":"Bossa Nova Civic Club is a strange anomaly in the New York nightlife world. For one, it&apos;s a legitimate venue with the bonafides of an underground warehouse party.&#xA0;Then there&apos;s the fact&#xA0;that, at two years old, Bossa Nova is just as cool as the day it opened (perhaps moreso, considering the caliber of acts they&apos;ve been booking). Parties may come and go, venues open and close, but so far Bossa Nova Civic Club remains the best place to dance&#xA0;for serious fans of electronic music.&#xA0;&#x2014; Nathan Reese","favorite":false},{"address":"470 Bergen St.","website":"bergenstreetcomics.com ","neighborhood":"Park Slope","image":"http://images.complex.com/complex/image/upload/t_article_image/wfrdir95d1thcv7xegb5.jpg","description":"2014 is a great time to be a comic book fan. Titles like <em>Saga </em>and <em>Pretty Deadly </em>have put creator-owned comics back on the map, big names like <em>Hawkeye </em>and <em>Moon Knight </em>have gone in fantastic new directions, and longtime favorites like <em>The Walking Dead </em>continue to go strong. Unfortunately, while comics themselves are doing just fine, brick and mortar&#xA0;shops are struggling. Enter Bergen Street Comics, a beautiful&#xA0;little store located between Prospect Heights and Park Slope. The staff is always friendly, the selection fantastic, and there&apos;s none of the creepy old-school vibe that some comic book stores still cling to. Whether you&apos;re a lifelong comic book lover, or just curious about getting back into them, you owe it to yourself to visit Bergen Street Comics. &#x2014; <a href=\"https://twitter.com/nathanreese\" target=\"_blank\">Nathan Reese</a><br><br>","favorite":false},{"address":"261 Moore St.","website":"robertaspizza.com ","neighborhood":"Williamsburg","image":"http://images.complex.com/complex/image/upload/t_article_image/v4i94sl7idyuv5tcuf3v.jpg","description":"<span>And then there&apos;s the Tiki Bar, out back, serving up frozen blended drinks and raging dance parties year round. Or the in-house radio station. Or the garden, or the apiary, or any of the other magical places&#x2014;on what could only be described less as a restaurant space, and more as a campus&#x2014;where they grow the stuff that goes in their food. And if you&apos;re lucky enough, you might one day get to see the inside of Blanca, the restaurant-within-a-restaurant of Roberta&apos;s, and possibly the hottest reservation in town these days, a meal people usually liken to a religious experience. Basic humans will shy away from the commute to Bushwick, or the two hour wait they&apos;ll give you at the door. Give not into the temptation to be basic: Head out back to the bar, get a drink, and settle in. One of the best meals/nights you can have in New York is just getting started. &#x2014; Foster Kamer</span><br><br>","favorite":false},{"address":"90 Wythe Ave.","website":"kinfolklife.com","neighborhood":"Williamsburg","image":"http://images.complex.com/complex/image/upload/t_article_image/pdar3vuhsrnlovb2kpjr.jpg","description":"<a href=\"http://kinfolklife.com/\" target=\"_blank\"></a>Kinfolk is everything all in one. By day, it&#x2019;s a quiet coffee shop&#x2014;don&#x2019;t worry, there&#x2019;s always drinks, too&#x2014;with a men&#x2019;s boutique next-door, with everything from literature to grooming products to clothing, and it&#x2019;s no regular Williamsburg shop. Everything from the interior design to the floor space to even the simple restaurant space&#x2014;it feels like home, except you can&#x2019;t cook as good as their kitchen can. And at night, the restaurant quickly turns into one of the hottest bars in the area&#x2014;hence why we once listed it as one of the best bars to find a one night stand in. (http://www.complex.com/city-guide/2013/02/10-nyc-bars-to-find-a-one-night-stand/kinfolk-studios-one-night-stand) They recently opened their event space at Kinfolk 94; it&#x2019;s one of the most stunning spaces in Williamsburg right now, as it features a dome-inspired wood structure that takes any other venue space and kicks it to the fucking curb. Looking for a place to play Drake&#x2019;s &#x201C;0 to 100&#x201D; into Bobby Shmurda on the weekend? This is your heaven.&#x2014; <a href=\"https://twitter.com/LAURENcynthia\" target=\"_blank\">Lauren Nostro</a>","favorite":false},{"address":"224 Lafayette St.","website":"jackswifefreda.com","neighborhood":"SoHo","image":"http://images.complex.com/complex/image/upload/t_article_image/ndqzeashqubs4ceq4dtr.jpg","description":"There may be no more &apos;SoHo&apos; a restaurant in SoHo than Jack&apos;s Wife Frieda, a cafe smack-dab in the center of the &apos;hood, as evidenced if anything by its constituency: Actors, fashion designers and editors, photographers, socialites, millionaire startup dorks, the service industry, globetrotting Europeans and South Americans, and that&apos;s the weekday crowd (weekends, especially at brunch, are less charmingly marked by Murray Hill gaggles having impromptu Birthright reunions <em>en masse</em>). But a constituency it is, for Jack&apos;s Wife Frieda is the kind of place it&apos;s hard <em>not</em> to become a regular at. Owners Dean and Maya Jankelowitz have an absurdly charming way of making everyone feel like family, be it your first time or your fifth visit this week, which is to say nothing of the menu: a wonderful mix of South African and Mediterranean soul food covering everything from peri peri chicken to matzoh ball soup, and a totally perfect burger with fries so good, models regularly risk their livelihoods over them. It&apos;d be a great restaurant anywhere, but under that striped little awning between Spring and Kenmare, it was a new classic from the moment it arrived. Go, now, and make yourself at home. &#x2014;<a href=\"https://twitter.com/weareyourfek\" target=\"_blank\">Foster Kamer</a>","favorite":false},{"address":"64 N. 9th St.","website":"roughtrade.com ","neighborhood":"Williamsburg","image":"http://images.complex.com/complex/image/upload/t_article_image/ifsqjvo9vqwu0svz7lzz.jpg","description":"As record shops in New York disappear one by one, Rough Trade is just getting started here in the city. The first Rough Trade store opened in London in the late &apos;70s, and in November of 2013, they set up shop in Williamsburg. Calling Rough Trade a record shop isn&apos;t really fair, though. Inside the warehouse space there is plenty of vinyl, but there are also books, exhibition spaces for art installments, keyboards to play around with, ping-pong tables, and a 250-person capacity venue in the back that rivals some of the best concert experiences in the city. In these modern times, when music junkies spend more time on SoundCloud than digging through records, Rough Trade has figured out how to bring music back to the physical world.&#x2014; <a href=\"https://twitter.com/pigsandplans\" target=\"_blank\">J</a><a href=\"https://twitter.com/pigsandplans\" target=\"_blank\">acob Moore</a>","favorite":false},{"address":"Various","website":"themeatballshop.com","neighborhood":"Various","image":"http://images.complex.com/complex/image/upload/t_article_image/fovjehtfl1vwkyxtrqkd.jpg","description":"<a href=\"http://themeatballshop.com/\" target=\"_blank\"></a><span>There are restaurants that cater to every kind of comfort food these days, from grilled cheese to, well, mac and cheese. The Meatball Shop is technically just another one of these, but it seems like something more&#x2014;and not just because they have their own Vans sneakers and Shut skateboard decks. Their Stanton Street location is the one I&#x2019;m thinking of, primarily it&#x2019;s because that&#x2019;s the one I frequent. Located between Allen and Orchard Streets right next to Epstein&#x2019;s Bar, The Meatball Shop is a relative newcomer that seems like it&#x2019;s been there all along. It&#x2019;s a place where &#x2018;90s hip-hop from both coasts flows as readily as their white peach sangria, and where daily specials supplement the fairly basic menu. As for that menu, it&#x2019;s primarily their housemade, locally sourced meatballs (natch) and what to have them over or on, including the traditional pasta as well as white beans or polenta. The Kitchen Sink, three balls over a medley of roasted vegetables and green salad fortified with apple slices, is spot-on for summer. And with five locations, getting there shouldn&#x2019;t be a problem. &#x2014; <a href=\"https://twitter.com/russbengtson\" target=\"_blank\">Russ Bengtson</a>&#xA0;</span>","favorite":false},{"address":"825 Atlantic Ave.","website":"None","neighborhood":"Prospect Heights","image":"http://images.complex.com/complex/image/upload/t_article_image/jg3mh1hgxxxyhuioqqof.jpg","description":"Hot Bird is a great place for people who like to spend time on Tinder. By that I mean Hot Bird is a great place for good-looking single Brooklynites looking to meet other good-looking single Brooklynites. It&#x2019;s also a great place to drink if you&#x2019;re one of those people who doesn&#x2019;t like bars that allow babies or children (GUILTY.) This spacious neighborhood classic is housed in what was an old auto-body shop that was later turned into a BBQ joint called Hot Bird. That closed, and then the bar was born. (I am told people still travel to Hot Bird thinking it&#x2019;s still a BBQ joint. Lucky for them, Little Brother BBQ is next door.) What I love most about Hot Bird is the spaciousness, the fact that there are no cocktail menus but the bartenders are brilliant mixologists, there are active fire pits during the winter, and the space is cavernous and dark enough to stay cool during the summer. I&#x2019;ve had many dates at Hot Bird, but full confession, I&#x2019;m really waiting for one of the bartenders to ask me out. &#x2014; Lauretta Charlton","favorite":false},{"address":"414 6th Ave. ","website":"bigelowchemists.com","neighborhood":"West Village","image":"http://images.complex.com/complex/image/upload/t_article_image/gqn5aesgtwlgtjmqpdnc.jpg","description":"But it&apos;s so much more than a drugstore. If there&apos;s any kind of product that might go in your bathroom, they have it. Colognes and candles from all over the world, discerningly picked&#x2014;there&apos;s never too much to choose from, or a lack of options, either. Everything from <a href=\"http://www.bigelowchemists.com/apothecary-health/morihata-binchotan-toothbrush.html\" target=\"_blank\">Japanese toothbrushes</a> to <a href=\"http://www.bigelowchemists.com/men/proraso-shaving-cream-refreshing-and-toning-formula.html\" target=\"_blank\">imported Italian shaving cream</a> gets represented, and this is all to say nothing of their over-the-counter medicine sections, too. Their own famous in-house brand is represented, as well, of course: Skin tonics, scents, candles, nearly all of the above. But if you choose to go your own way, chances are, someone in the store could speak to whatever product you&apos;re looking at all too well. From the glass counters to carpet and mosaic tile mix, from the signage to the cranky if not well informed pharmacists, C.O. Bigelow really does have something for everyone, and is one of the most perfect present shopping destinations in the city. Moreover, one of the oldest and last independently owned pharmacies in it, as well, a place that stands as perfect proof that while New York City is a disappearing city, always, its longest lasting artifacts are so typically its greatest.&#x2014;<a href=\"https://twitter.com/weareyourfek\" target=\"_blank\">Foster Kamer</a>","favorite":false},{"address":"31 Greenpoint Ave.","website":"oven.ly ","neighborhood":"Greenpoint","image":"http://images.complex.com/complex/image/upload/t_article_image/auheiaaxgtizbpphyzmi.jpg","description":"Founded by Erin Patinkin and Agatha Kulaga, this glowing little bakery is tucked away in a nice corner of Greenpoint near the waterfront. It&#x2019;s an unassuming wholesaler that feels comfortable serving traditional favorites, such as salted chocolate chip cookies, as well as new-school delights, including the must-have Brooklyn Blackout. It&#x2019;s a great place to stop by after enjoying a picnic in WNYC Transmitter Park, or buying a couple of used booked at Word. &#x2014; <a href=\"https://twitter.com/laurettaland\" target=\"_blank\">Lauretta Charlton</a><br><br>","favorite":false},{"address":"46-63 Metropolitan Ave.","website":"bunkervietnamese.com","neighborhood":"Ridgewood","image":"http://images.complex.com/complex/image/upload/t_article_image/pybncsr7bydsorvrrnz1.jpg","description":"<a href=\"http://bunkervietnamese.com/\" target=\"_blank\"></a>They say it&apos;s as much if not more about the journey than it is the destination, right? Tell that to anyone who&apos;s tried walking out to the far reaches of industrial Bushwick, Brooklyn to get to Bun-Ker. But if they make it past the railroad tracks, and North Brooklyn&apos;s greatest/worst/only strip club Pumps, they will finally find what they have been looking for: A tiny shack of a building that serves Vietnamese food. And yet, it&apos;s a shack that holds wonders (and not even the kind that thinks &quot;Bandz a Make Her Dance&quot; is part of the Great American Songbook). Run by an odd combination of former four-star chefs and skate rats, Bun-Ker is everything you&apos;ve heard about New York City&apos;s revolutionary Asian cuisine, but without the bullshit or frills. It all carries a core of authenticity that&apos;s filtered through smart adjustments to flavor that elevate it beyond the realm of religiously authentic and into a greater, higher purpose: Damn great food as a reasonable price. The bahn-mi is as close to a perfect sandwich as you&apos;ll find, as is the pho for a bowl of noodles, which goes without mentioning the tomato fried rice, the crab spring rolls, and so on. It&apos;s all great, and in a fun, communal, kinda BYOB environs. But the Bahn-Xeo is what you&apos;ve come in search for&#x2014;a stuffed and fried egg crepe as crispy as it is light, served with a handful of veggies and herbs to hold its contents: egg, shrimp, bacon, to name a few. It&apos;s the most unconventional egg sandwich you&apos;ll ever eat, and also, the greatest. Just make sure to get the appropriately decadent ending to that meal you deserve: A cab ride. Or a lap dance at Pumps. Either/or.&#x2014;&#xA0;<a href=\"https://twitter.com/weareyourfek\" target=\"_blank\">Foster Kamer</a>","favorite":false},{"address":"326 Dekalb Ave. ","website":"None","neighborhood":"Clinton Hill ","image":"http://images.complex.com/complex/image/upload/t_article_image/szxvwyc0qbwjkhsszrtb.jpg","description":"Everyone loves pizza, but not everyone is lucky enough to have a local pizzeria as good as Luigi&#x2019;s. This Clinton Hill staple is frequented by Brooklynites from all over the borough and students at the nearby Pratt Institute. Luigi&#x2019;s doesn&#x2019;t deliver, but they don&#x2019;t need to deliver to keep its dedicated customers coming back for more slices and pies. This is New York style pizza that&#x2019;s made in what I would call a hole in the wall. There&#x2019;s no seating and most people place their order while leaning in through the service window and standing outside on the sidewalk. Of course, you can make arguments for a number of different restaurants in New York City having the absolute best pizza this town has to offer. Luigi&#x2019;s is where you go it you want the no-frills, no-nonsense slice that can satisfy even the most cynical New York foodie. &#x2014; <a href=\"https://twitter.com/laurettaland\" target=\"_blank\">Lauretta Charlton&#xA0;</a><br><br>","favorite":false},{"address":"Sara D. Roosevelt Park","website":"nycgovparks.org/parks/saradroosevelt","neighborhood":"Chinatown","image":"http://images.complex.com/complex/image/upload/t_article_image/ntptfbir5k5gelbc61xe.jpg","description":"<span>Oh, and feel free to grab a drink at any of the great watering holes in the neighborhood. There&apos;s nothing better than ending a great footy session with a pint of something imported. &#x2014; Julian Patterson</span>","favorite":false},{"address":"62 Pike St.","website":"nycgovparks.com","neighborhood":"Lower East Side","image":"http://images.complex.com/complex/image/upload/t_article_image/e3hu25jmfyfdyt1wddzl.jpg","description":"<a href=\"http://nycgovparks.com/\" target=\"_blank\"></a>New York City has always been a haven for skateboarding and BMX ever since the earliest days, the streets serving as a playground for riders both casual and serious. But as far as skateparks went it always lagged behind, whether because of legal issues, property values or just the fact that the city itself was its own park. There were ramps, most notably at Mullally Park in the Bronx, Chelsea Piers, and later Millennium Park in Brooklyn, but nothing downtown save for the quasi-official Brooklyn Banks under the bridge. That&#x2019;s all changed. Coleman Skatepark under the Manhattan Bridge started as just a collection of prefab ramps and obstacles, but has since grown to be a legit park, complete with steel-coping transition and any number of ledges and manual pads. It&#x2019;s home to several annual contests and jams both official and unofficial&#x2014;including Harold Hunter Day&#x2014;as well as daily sessions for kids of all ages. Or feel free to just go watch. &#x2014;&#xA0;<a href=\"https://twitter.com/russbengtson\" target=\"_blank\">Russ Bengtson</a>&#xA0;","favorite":false},{"address":"204 Varick St.","website":"sobs.com","neighborhood":"SoHo","image":"http://images.complex.com/complex/image/upload/t_article_image/gtjh80wpw5ttkq1yiute.jpg","description":"<a href=\"http://sobs.com/\" target=\"_blank\"></a>S.O.B.&apos;s will always be one of the most legendary venues for artists on the rise in New York City. Most nights, it&#x2019;s a Brazilian restaurant and on weekends, there&#x2019;s the always fun Bossa Nova Brunch, but let&#x2019;s be real: <span>S.O.B.&apos;s</span>&#xA0;won&#x2019;t be remembered for its cuisine. Most of your favorite rappers had their first major showcase at the South Village spot. Hot 97 still puts on monthly showcases at the venue, while everyone from Drake to Kanye West and more have once graced the stage on the come up. A little under a year ago, four patrons were shot inside the club when DMV/MMG&#x2019;s Fat Trel was set to perform. It affected the general perception of the club, and its security, but over the past few months, <span>S.O.B.&apos;s</span>&#xA0;has truly attempted to rebuild its reputation as one of the most important venues in the city. &#x2014;&#xA0;<a href=\"https://twitter.com/LAURENcynthia\" target=\"_blank\">Lauren Nostro</a>","favorite":false},{"address":"304 E. 6th St.","website":"mayahuelny.com ","neighborhood":"East Village","image":"http://images.complex.com/complex/image/upload/t_article_image/xph0ipgsiv96jklbc0kh.jpg","description":"<span>This is an East Village classic, but it&#x2019;s hardly noticeable to the untrained eye. Upon close inspection, however, you&#x2019;ll see a random dude standing on a sidewalk in the East Village for no apparent reason. Once you grab his attention and he sizes you up a bit, you&#x2019;re led into a dimly-lit hacienda style tequila tasting room that has some of the best anejo available in the States. Beyond that, there are delicious bites available from chef Vincent Gonzalez, and the bartenders are incredibly helpful and knowledgeable. If the ceviche is on the menu, definitely order it. <span>&#x2014;&#xA0;</span><a href=\"https://twitter.com/laurettaland\" target=\"_blank\">Lauretta Charlton</a>&#xA0;</span><br><br>","favorite":false},{"address":"84 Havemeyer St.","website":"onomeanyc.com","neighborhood":"Williamsburg","image":"http://images.complex.com/complex/image/upload/t_article_image/zczfubyrcgxdc1zx1mc6.jpg","description":"Brooklyn&apos;s a long way from where Costa, who used her family recipes for the food, hails from. It&apos;s hard to imagine a Hawaiian not getting homesick here. But that&apos;s ultimately why Onomea&apos;s so great. Sure, it might fill a desperately needed gap in New York&apos;s food culture, while also elevating blue collar Hawaiian cuisine, and do it well enough to withstand the not-so-shaka mainland types here. But critically, and in more than name, it also feels like that thing so many chefs and restauranteurs strive for: A genuine expression of home.<em>- </em>Foster Kamer","favorite":false},{"address":"Prospect Park","website":"prospectpark.org ","neighborhood":"Prospect Heights","image":"http://images.complex.com/complex/image/upload/t_article_image/axqf87qfdmupk0tkuaw6.jpg","description":"Of course you can Bloomberg one part of Brooklyn, but you can&#x2019;t Bloomberg the whole thing, and, thankfully, Prospect Park Lake still retains plenty of its old world charm: sidewalks that flood and create private areas for bird-watching or oral sex; picnic grounds that can accommodate impromptu (i.e. totally illegal) campfires, and the best weed-smoking spots with water views in the city this side of Sunset Park. So, as the Chamber of Commerce would put it: Come to Prospect Park Lake! Get your kid wet! Get your dick wet! Just...don&#x2019;t do them at the same time. &#x2014; <a href=\"https://twitter.com/fultimejackmove\" target=\"_blank\">Jack Erwin</a>","favorite":false}]